{"name":"Fiona Cai","headerTaglineOne":"hey there,","headerTaglineTwo":"I'm Fiona.","headerTaglineThree":"Toronto, ON","headerTaglineFour":"","showCursor":false,"showBlog":true,"darkMode":false,"showResume":true,"socials":[{"id":"1","title":"Github","link":"https://github.com/fiona-cai"},{"id":"2","title":"LinkedIn","link":"https://www.linkedin.com/in/fiona--cai/"},{"id":"4","title":"Medium","link":"https://medium.com/@fiona-cai"},{"id":"5","title":"Email","link":"mailto:fiona.cai899@gmail.com"}],"projects":[{"title":"Mortgage Payment Calculator","description":"During my internship at RBC, my team led the development of a mortgage payment calculation web application designed to assist over 180,000 clients in selecting optimal mortgage payment options based on various inputs. This solution featured dynamic payment calculations and was integrated with a new mortgage renewal tool, providing a seamless one-click experience for clients to choose better rates and payment options.\n\nUtilized Angular and an in-house RBC design system (RIG) for the responsive frontend, while the backend was powered by Java and Spring Boot to handle complex calculations and business logic. The application was deployed to the UAT environment using OpenShift 4 and Jenkins, following CI/CD best practices for smooth releases.\n\nThe project earned recognition from stakeholders for its technical execution and presentation.","imageSrc":"/images/1724537604160.jpeg","url":"https://www.linkedin.com/posts/fiona--cai_internship-rbc-activity-7233239154753429505-lDoe?utm_source=share&utm_medium=member_desktop","headline":"💻 Internship at RBC"},{"title":"Team Swordfish","description":"In the CanSat Design Challenge held in Lethbridge, Alberta, our team designed a satellite the size of a pop can, which was launched by high-powered amateur rockets (or carried by a drone) to a height of up to one kilometer. During its descent, our CanSat conducted experiments using Terrain Relative Navigation to precisely track its position and attitude, utilizing only an onboard camera and an inertial navigation system. This technology is essential in environments where GPS is unavailable, such as the Moon. The embedded software uses C/C++ and a finite state machine to manage the CanSat's operational states (Idle, Data Acquisition, Touchdown). Our innovative approach earned us the Best Technical and Best Scientific Mission awards at the competition. Following our success, we were invited to appear on the show \"Ask an Astronomer.\"","imageSrc":"/images/Screen Shot 2024-08-11 at 9.24.57 PM.png","url":"https://www.instagram.com/team__swordfish/","headline":"Canadian CanSat 🚀 Design Challenge"},{"title":"Signematic","headline":"2nd Place 🏆 at JAMHacks 8","description":"JAMHacks is one of Canada's largest high school hackathons based out of the University of Waterloo with 150+ high school hackers. Our submission, Signematic, aims to provide live sign language transcription for videos and movies using advanced machine-learning algorithms and gesture models. Our solution ensures that the deaf and hard-of-hearing community can enjoy a seamless viewing experience with accurate and real-time sign language interpretation.","imageSrc":"/images/1718145254710.jpeg","url":"https://dorahacks.io/buidl/13405"},{"title":"Rhino's Quest","description":"You play as Racket the Rhino, an endangered Javan Rhino, who fights back against deforestation and shoots Awake™ Bars at the humans invading his home with his trusty catapult. Navigate the levels with your custom-built controller in hand.\n\nBy advancing through multiple levels, fighting back against hordes of CS students, and discovering the evil prof's lab, you'll save the world and restore it to its natural order.","imageSrc":"https://d112y698adiu2z.cloudfront.net/photos/production/software_photos/003/098/118/datas/gallery.jpg","url":"https://devpost.com/software/elap","headline":"Platform Game with 3D Controller"},{"title":"YRHacks","description":"Lead Organizer of 2 iterations (YRHacks 4 & 5) and Executive of YRHacks 3 - YRHacks is the official annual hackathon of the York Region District School\nBoard, supported by the Specialist High Skills Major (SHSM) program. Our\nmission is to create a welcoming and exciting hackathon experience for high\nschool students of all strengths and skill levels. We facilitate participants to\ngather in teams to create projects, as well as attend workshops and social\ngatherings.\nYRHacks is an environment for students to come together and experiment with\ntheir creative ideas. Each year we welcome around 300 students to our hackathon.","imageSrc":"/images/CrowdPhoto.JPG","url":"https://yrhacks.ca/","headline":"Offical YRDSB Hackathon"},{"title":"Codebuds","description":"Founder + Executive Director - Codebuds was an innovative non-profit organization, driven by a passionate team of young leaders who are committed to transforming the future of technology. Lead a team of 17 in writing a computing contest with 100+ attendees and hackathon with 70+ attendees. Built up platforms to reach 25,000+ students (10,000+ impressions on Instagram) with collaborations (i.e. attending Ignite Fair by Volunteer Toronto), and distributing $100,000+ worth of prizes within 4 months.","imageSrc":"https://ugc.production.linktr.ee/3545c3a3-6ba7-4039-b59a-bf727489ff85_codebudslogos-02.png?io=true&size=avatar-v3_0","url":"https://www.linkedin.com/company/codebudscanada/","headline":"Non-Profit Organization  🌱"},{"title":"TrackBack","headline":"Memory Assistant for Seniors with Dementia","description":"TrackBack helps seniors navigate memory loss by leveraging object detection with YOLOv4 to track and log everyday items. Users can search for misplaced objects through a conversational web app interface powered by Voiceflow's LLM, which retrieves the object's location, bounding box, and prominent color from recorded footage. TrackBack features an intuitive UI designed for ease of use by seniors, focusing on simple chat-based interactions.","imageSrc":"https://d112y698adiu2z.cloudfront.net/photos/production/software_thumbnail_photos/003/022/384/datas/medium.png","url":"https://devpost.com/software/trackback"},{"id":"06809bad-56a8-41e3-a299-228df76413e4","title":"\"See\"","description":"\"See\" is an innovative AI-powered assistive tool designed to empower visually impaired individuals by providing seamless, voice-driven interaction with their surroundings. Leveraging Meta's Llama models and advanced context-aware technology, \"See\" offers a highly personalized experience through natural voice commands, auditory feedback, and offline functionality. It simplifies complex tasks like navigation, object recognition, and text reading, enabling users to gain independence and confidently explore the world with a single tap. Designed for accessibility and adaptability, \"See\" works across devices, breaking barriers and redefining inclusion for the blind community.\n\n\n\n\n\n","imageSrc":"https://images2.imgbox.com/31/e1/7PxH7Sjw_o.png","url":"https://github.com/fiona-cai/meta-llama","headline":"Made at Meta's first Llama hackathon in Toronto"},{"title":"VocalAI","headline":"Karaoke App","description":"VocalAI includes two main features:\n\nKaraoke Creation: Converts any song into a karaoke track that matches the original composition.\nSpeech Recognition & Pitch Scoring: Analyzes vocal delivery for accurate pronunciation and pitch, providing real-time feedback and scoring.\nThese tools offer personalized guidance and track progress to help improve singing abilities.","imageSrc":"https://d112y698adiu2z.cloudfront.net/photos/production/software_thumbnail_photos/002/507/975/datas/medium.png","url":"https://devpost.com/software/vocalai"},{"title":"Homework Run","headline":"Augmented Reality Game","description":"Homework Run is an augmented reality game that motivates players to stay active while dodging obstacles and answering trivia questions. By tracking body movements through the player's webcam, the game challenges users to avoid obstacles like cellphones and Instagram icons. Collisions prompt true-false questions on a chosen topic, adding an educational twist. The game uses OpenCV for motion detection, MediaPipe for pose tracking, and OpenAI's GPT-3.5 for generating trivia questions, creating a fun way to blend learning with physical activity.","imageSrc":"https://d112y698adiu2z.cloudfront.net/photos/production/software_photos/002/993/672/datas/gallery.jpg","url":"https://devpost.com/software/homework-run"},{"title":"CrisisControl","headline":"Solution to a GreenHouse issue","description":"CrisisControl parses emergency disaster phone calls to improve dispatchers' accuracy and speed in assessing the situation and properly requisitioning emergency responders.\n\nWhen a call is ended, the transcription of the call is parsed and analyzed to provide a concise overview for the dispatcher to review, verify, and dispatch responders, who receive a brief overview on their screens.","imageSrc":"https://d112y698adiu2z.cloudfront.net/photos/production/software_thumbnail_photos/002/967/039/datas/medium.png","url":"https://devpost.com/software/crisiscontrol"},{"title":"Bayview StuCo","headline":"My School's Student Council","description":"I first joined the council in grade 9 and I've been re-elected to basically the same position ever since. My role has always been spearheading the outreach team, and much of my attention was always spent on the school website. Many of my best high school experiences from grade 9 all the way to grade 12 have been from serving in student council, representing 2100+ students.","imageSrc":"https://www.bayviewstuco.ca/assets/img/ombre_logo.png","url":"https://www.bayviewstuco.ca/"}],"services":[{"id":"1","title":"Front-End Development","description":"I've made sites for all types of things: student council, clubs, organizations, rocket GUIs - you name it."},{"id":"2","title":"Design","description":"I like to think my designs are playful yet minimalistic. Whether I'm designing websites, Instagram posts, or club merch, my focus is always to keep it simple."},{"id":"3","title":"Webmaster-ing","description":"I have a few sites right now that I have to regularly manage updates. It's quite a long-term commitment but it's taught me a thing or two about self-regulation."},{"id":"4","title":"Teamwork","description":"I truly believe that teamwork makes the dreamwork. Having worked with so many people, I know not only how to be a good team leader, but also a good team member"}],"aboutpara":"Staying awake at hackathons, staying awake to organize hackathons, mathing away, launching rockets, performing at retirement homes, developing websites, organizing school events, singing at coffeehouses, and designing things - in my \"spare\" time.","resume":{"tagline":"coming soon","description":"coming soon","experiences":[{"id":"1","dates":"coming soon","type":"coming soon","position":"coming soon","bullets":"coming soon"},{"id":"d495c23b-4f65-479a-9b8a-cfbc1c089725","dates":"coming soon","type":"coming soon","position":"coming soon","bullets":"coming soon"}],"education":{"universityName":"coming soon","universityDate":"coming soon","universityPara":"coming soon"}},"skills":[{"name":"Illustrator","icon":"/icons/Adobe_Illustrator.svg"},{"name":"Premiere Pro","icon":"/icons/Adobe_Premiere_Pro.svg"},{"name":"Angular","icon":"/icons/Angular.svg"},{"name":"AWS","icon":"/icons/AWS.svg"},{"name":"Bootstrap","icon":"/icons/Bootstrap.svg"},{"name":"C++","icon":"/icons/C++.svg"},{"name":"CSS","icon":"/icons/CSS.svg"},{"name":"FastAPI","icon":"/icons/FastAPI.svg"},{"name":"Figma","icon":"/icons/Figma.svg"},{"name":"Flask","icon":"/icons/Flask.svg"},{"name":"Git","icon":"/icons/Git.svg"},{"name":"Godot","icon":"/icons/Godot.svg"},{"name":"Go","icon":"/icons/Go.svg"},{"name":"HTML","icon":"/icons/HTML.svg"},{"name":"Java","icon":"/icons/Java.svg"},{"name":"JavaScript","icon":"/icons/JavaScript.svg"},{"name":"Jenkins","icon":"/icons/Jenkins.svg"},{"name":"Jira","icon":"/icons/Jira.svg"},{"name":"jQuery","icon":"/icons/jQuery.svg"},{"name":"JSON","icon":"/icons/JSON.svg"},{"name":"LaTeX","icon":"/icons/LaTeX.svg"},{"name":"Next.js","icon":"/icons/Next.js.svg"},{"name":"Node.js","icon":"/icons/Node.js.svg"},{"name":"OpenCV","icon":"/icons/OpenCV.svg"},{"name":"PostgresSQL","icon":"/icons/PostgresSQL.svg"},{"name":"Python","icon":"/icons/Python.svg"},{"name":"React","icon":"/icons/React.svg"},{"name":"Spring","icon":"/icons/Spring.svg"},{"name":"Tailwind CSS","icon":"/icons/Tailwind_CSS.svg"},{"name":"Three.js","icon":"/icons/Three.js.svg"},{"name":"TypeScript","icon":"/icons/TypeScript.svg"},{"name":"Vercel","icon":"/icons/Vercel.svg"}]}