{
    "name": "Fiona Cai",
    "headerTaglineOne": "hey there,",
    "headerTaglineTwo": "I'm Fiona.",
    "headerTaglineThree": "Toronto, ON",
    "headerTaglineFour": "",
    "showCursor": false,
    "showBlog": true,
    "darkMode": false,
    "showResume": true,
    "socials": [
        {
            "id": "1",
            "title": "Github",
            "link": "https://github.com/fiona-cai"
        },
        {
            "id": "2",
            "title": "LinkedIn",
            "link": "https://www.linkedin.com/in/fiona--cai/"
        },
        {
            "id": "4",
            "title": "Medium",
            "link": "https://medium.com/@fiona-cai"
        },
        {
            "id": "5",
            "title": "Email",
            "link": "mailto:fiona.cai899@gmail.com"
        }
    ],
    "projects": [
        {
            "id": "1",
            "title": "Signematic",
            "headline": "2nd Place 🏆 at JAMHacks 8",
            "description": "JAMHacks is one of Canada’s largest high school hackathons based out of the University of Waterloo with 150+ high school hackers. Our submission, Signematic, aims to provide live sign language transcription for videos and movies using advanced machine-learning algorithms and gesture models. Our solution ensures that the deaf and hard-of-hearing community can enjoy a seamless viewing experience with accurate and real-time sign language interpretation.",
            "imageSrc": "https://cdn.dorahacks.io/static/files/18ffd1dae86e35f7cba1ab44b068e605.png@256h.webp",
            "url": "https://dorahacks.io/buidl/13405"
        },
        {
            "id": "2",
            "title": "Team Swordfish",
            "description": "(Best Technical + Best Scientific Mission)\n\nIn the CanSat Design Challenge, teams students design a “satellite” which is the size of a pop can in Lethbridge, Alberta. The CanSat is launched by high-powered amateur rockets (or carried by a drone) to a height of up to one kilometer, and conducts its experiments as it descends.\n\nOur CanSat used Terrain Relative Navigation to precisely track its position and attitude using only an onboard camera and inertial navigation system. This is necessary in environments where GPS is not available, like the Moon. \n\nAfter the competition, we were invited on the show \"Ask an Astronomer\".",
            "imageSrc": "/images/Screen Shot 2024-08-11 at 9.24.57 PM.png",
            "url": "https://www.instagram.com/team__swordfish/",
            "headline": "Canadian CanSat 🚀 Design Challenge"
        },
        {
            "id": "e4610d95-c573-4851-93bf-c7f15d040b59",
            "title": "Codebuds",
            "description": "Founder + Executive Director and now Board Director - Codebuds is an innovative non-profit organization, driven by a passionate team of young leaders who are committed to transforming the future of technology. Lead a team of 17 in writing a computing contest with 100+ attendees and hackathon with 70+ attendees. Built up platforms to reach 25,000+ students (10,000+ impressions on Instagram) with collaborations (i.e.\nattending Ignite Fair by Volunteer Toronto), and distributing $100,000+ worth of prizes within 4 months.",
            "imageSrc": "https://ugc.production.linktr.ee/3545c3a3-6ba7-4039-b59a-bf727489ff85_codebudslogos-02.png?io=true&size=avatar-v3_0",
            "url": "https://www.linkedin.com/company/codebudscanada/",
            "headline": "Non-Profit Organization  🌱"
        },
        {
            "id": "2dfb7e79-9715-41f6-9177-5f57c5235a7c",
            "title": "YRHacks",
            "description": "Co-Lead Organizer of 2 iterations (YRHacks 4 & 5) and Executive of YRHacks 3 - YRHacks is the official annual hackathon of the York Region District School\nBoard, supported by the Specialist High Skills Major (SHSM) program. Our\nmission is to create a welcoming and exciting hackathon experience for high\nschool students of all strengths and skill levels. We facilitate participants to\ngather in teams to create projects, as well as attend workshops and social\ngatherings.\nYRHacks is an environment for students to come together and experiment with\ntheir creative ideas. Each year we welcome around 300 students to our hackathon.",
            "imageSrc": "https://yrhacks.ca/assets/logos/logo-transparent.svg",
            "url": "https://yrhacks.ca/",
            "headline": "Offical YRDSB Hackathon"
        },
        {
            "id": "74d57479-dd46-47c7-9ca6-cb687aa96796",
            "title": "Rhino's Quest",
            "description": "You play as Racket the Rhino, an endangered Javan Rhino, who fights back against deforestation and shoots Awake™ Bars at the humans invading his home with his trusty catapult. Navigate the levels with your custom-built controller in hand.\n\nBy advancing through multiple levels, fighting back against hordes of CS students, and discovering the evil prof's lab, you'll save the world and restore it to its natural order.",
            "imageSrc": "https://d112y698adiu2z.cloudfront.net/photos/production/software_photos/002/620/369/datas/gallery.jpg",
            "url": "https://devpost.com/software/elap",
            "headline": "Platform Game with 3D Controller"
        },
        {
            "id": "3",
            "title": "VocalAI",
            "headline": "Karaoke App",
            "description": "VocalAI includes two main features:\n\nKaraoke Creation: Converts any song into a karaoke track that matches the original composition.\nSpeech Recognition & Pitch Scoring: Analyzes vocal delivery for accurate pronunciation and pitch, providing real-time feedback and scoring.\nThese tools offer personalized guidance and track progress to help improve singing abilities.",
            "imageSrc": "https://d112y698adiu2z.cloudfront.net/photos/production/software_thumbnail_photos/002/507/975/datas/medium.png",
            "url": "https://devpost.com/software/vocalai"
        },
        {
            "id": "4",
            "title": "CrisisControl",
            "headline": "Solution to a GreenHouse issue",
            "description": "CrisisControl parses emergency disaster phone calls to improve dispatchers' accuracy and speed in assessing the situation and properly requisitioning emergency responders.\n\nWhen a call is ended, the transcription of the call is parsed and analyzed to provide a concise overview for the dispatcher to review, verify, and dispatch responders, who receive a brief overview on their screens.",
            "imageSrc": "https://d112y698adiu2z.cloudfront.net/photos/production/software_thumbnail_photos/002/967/039/datas/medium.png",
            "url": "https://devpost.com/software/crisiscontrol"
        },
        {
            "id": "4",
            "title": "Bayview StuCo",
            "headline": "My School's Student Council",
            "description": "I first joined the council in grade 9 and I've been re-elected to basically the same position ever since. My role has always been spearheading the outreach team, and much of my attention was always spent on the school website. Many of my best high school experiences from grade 9 all the way to grade 12 have been from serving in student council, representing 2100+ students.",
            "imageSrc": "https://www.bayviewstuco.ca/assets/img/ombre_logo.png",
            "url": "https://www.bayviewstuco.ca/"
        }
    ],
    "services": [
        {
            "id": "1",
            "title": "Front-End Development",
            "description": "I've made sites for all types of things: student council, clubs, organizations, rocket GUIs - you name it."
        },
        {
            "id": "2",
            "title": "Design",
            "description": "I like to think my designs are playful yet minimalistic. Whether I'm designing websites, Instagram posts, or club merch, my focus is always to keep it simple."
        },
        {
            "id": "3",
            "title": "Webmaster-ing",
            "description": "I have a few sites right now that I have to regularly manage updates. It's quite a long-term commitment but it's taught me a thing or two about self-regulation."
        },
        {
            "id": "4",
            "title": "Teamwork",
            "description": "I truly believe that teamwork makes the dreamwork. Having worked with so many people, I know not only how to be a good team leader, but also a good team member"
        }
    ],
    "aboutpara": "Staying awake at hackathons, staying awake to organize hackathons, launching rockets, performing at retirement homes, developing websites, organizing school events, singing at coffeehouses, and designing things - in my \"spare\" time.",
    "resume": {
        "tagline": "coming soon",
        "description": "coming soon",
        "experiences": [
            {
                "id": "1",
                "dates": "coming soon",
                "type": "coming soon",
                "position": "coming soon",
                "bullets": "coming soon"
            },
            {
                "id": "d495c23b-4f65-479a-9b8a-cfbc1c089725",
                "dates": "coming soon",
                "type": "coming soon",
                "position": "coming soon",
                "bullets": "coming soon"
            }
        ],
        "education": {
            "universityName": "coming soon",
            "universityDate": "coming soon",
            "universityPara": "coming soon"
        },
        "languages": [
            "Javascript",
            "HTML5",
            "CSS",
            "Python",
            "Go"
        ],
        "frameworks": [
            "React",
            "Typescript",
            "NodeJs"
        ],
        "others": [
            "Figma",
            "AdobeXD",
            "AWS"
        ]
    }
}